# Create Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CircuitNamingScheme..::..Create Method
CircuitNamingScheme Class See Also
---
Creates a new CircuitNamingScheme.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static CircuitNamingScheme Create(
	Document document,
	string name,
	IList<TableCellCombinedParameterData> data
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	document As Document, _
	name As String, _
	data As IList(Of TableCellCombinedParameterData) _
) As CircuitNamingScheme
```

Visual C++
---
```text
public:
static CircuitNamingScheme^ Create(
	Document^ document,
	String^ name,
	IList<TableCellCombinedParameterData^>^ data
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document in which to create the CircuitNamingScheme.
name
    Type: System..::..String The name of CircuitNamingScheme.
data
    Type: System.Collections.Generic..::..IList<(Of <(<'TableCellCombinedParameterData>)>)> The array of TableCellCombinedParameterData to be set as combined parameters.
# ### Return Value
The newly created CircuitNamingScheme.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], | , ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as a CircuitNamingScheme name. -or- The data contains invalid parameter id. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CircuitNamingScheme Class
Autodesk.Revit.DB.Electrical Namespace